import React, { useState } from 'react';
import '../../styles/website.css';

function Header() {
  const [openPopup, setOpenPopup] = useState(false);
  const [menuOpen, setMenuOpen] = useState(false);

  const toggleMenu = () => setMenuOpen(!menuOpen);

  return (
    <>
      <header>
        <div className="left-header">
          <img src="src\img\Face_logo_black.png" alt="" />
        </div>
        <div className="hamburger" onClick={toggleMenu}>
          <div className={menuOpen ? "bar open" : "bar"}></div>
          <div className={menuOpen ? "bar open" : "bar"}></div>
          <div className={menuOpen ? "bar open" : "bar"}></div>
        </div>
        <ul className={`right-header-ul ${menuOpen ? 'open' : ''}`}>
          <li><a href="/">Начало</a></li>
          <li><a onClick={() => setOpenPopup(true)}>Още нещо</a></li>
          <li><a href="/quiz">Опознай себе си</a></li>
        </ul>
      </header>

      {openPopup && (
        <div className="popup">
          <div className="popup-inner">
            <img src="src\img\x.png" alt="close button" onClick={() => setOpenPopup(false)} />
            <p>Физиогномиката е науката за изучаване на лицето и изразите му с цел разпознаване на характера и личността на човек. Тази практика има дълга история и се свързва с древни цивилизации като Китай, Гърция и Египет. <br /> Според физиогномиката, лицето е като "карта" на вътрешния свят на човека, а различните черти, като формата на устата, носа, челото и очите, могат да разкрият тайни за неговия темперамент и поведение. <br />

Например, ако човек има широко чело, това може да показва интелигентност или склонност към анализиране на ситуации. Ако устата е по-голяма, може да се счита за знак за комуникативност и изразителност. В същото време, ако очите са малки и стиснати, това може да се тълкува като индикатор за скритост или предпазливост.

Разбира се, физиогномиката не е точна наука, а по-скоро един от начините за интерпретация на човешкото поведение. Тя е била използвана от философи и лекари през различни исторически периоди, но с развитието на психологията и науките, тези теории биват поставени под съмнение. Все пак, физиогномиката остава интересна и се използва в някои области, като психологията и криминологията, за да се опитаме да разберем личността на човек чрез неговите физически черти.

Физиогномиката обаче трябва да се приема с доза предпазливост. Не трябва да се забравя, че външността не винаги отразява вътрешния свят на личността. Хората са сложни и многофасетни, и не може да се поставят лесно в кутии само въз основа на физическите им черти.</p>
          </div>
        </div>
      )}
    </>
  );
}

export default Header;
