import React, { Suspense } from 'react';
import "../../../styles/quiz.css"

const History = () => {
  return (
    <div className="job art">
        <div className="jobmodel">
        <div className="arth1">ИСТОРИЯ</div>
        <div className="artp">
            <img src="/images/down-arrow.png" alt="down" />
            Имаш невероятен талант за история! Обичаш да откриваш миналото и да разгадаваш събитията, които са оформили света около нас. Твоето внимание към детайлите и аналитично мислене те правят истински историк, готов да открие скритите уроци на човечеството! 📚🏺          </div>
        </div>
    </div>
  );
};

export default History;